/*
* Напишите функцию которая будет принимать 1 аргумент и в зависимости от типа аргумента
*
* Если тип аргумента число или объект -> возвращать true
* Если тип аргумента функция -> возвращать false
* Если тип аргумента Строка и длина этой строки не равна 10 -> возвращать "длина вашей строки: <длина строки>
*                            Если длина 10 -> 'you win'
*
*
*
*
* */

































/*

Напишите функцию, которая принимает первым
параметром массив с числами
и отображает в консоле последовательно все значения
умноженные на 2

*/


























/*

Напишите функцию, которая ВЕРНЕТ массив
с нечетными значениями

*/