/*

 Практическая часть:
 Напишите условие, в котором сценарий пойдет
 по альтернативной ветке.
 Будет содержать 2 уровня вложенности и будет
 выполняться самый нижный уровень вложенности

*/

/*

  Используя конструкцию if..else, напишите код,
  который получает значение prompt, а затем выводит alert:

  1, если значение больше нуля,
  -1, если значение меньше нуля,
  0, если значение равно нулю.

*/

/*

 Classwork 3 - Задача 1:

 Сделайте калькулятор в браузере.
 Используйте prompt, Спросите у пользователя два числа
 и верните ему сумму данных чисел через alert;

 Если пользователь указал не число, выведите сообщение об ошибке

 */

/*
* Запрашиваем число 1
* 1. -> +qwe -> NaN (typeof NaN == 'number')
* 2. -> +'1' -> 1 (typeof 1 == 'number')
*
*
* 1. отобразить модальное с запросом пользователя
* ввести число
* 2. Преобразовать ответ пользователя к числу
* 3. Проверить является ли введеной пользователем значение числом
* 4. Если не является числом -> отобразить ошибку
* 5. Сделать еще 1 запрос на ввод числа
* 6. Запросить у пользователя ввод числа 2
* 7. Отобразить сумму чисел в модальном окне
*
* */
// let prompt1 = +prompt('введите число 1')
// if (isNaN(prompt1)) {
//   alert('введите пожалуйста число')
//   prompt1 = +prompt('введите число 1')
//   if (isNaN(prompt1)) {
//     alert('введите пожалуйста число попытка #2')
//     prompt1 = +prompt('введите число 1')
//   }
// }

function promptWithValidation() {
  let userNumber = +prompt('введите число')

  if (isNaN(userNumber)) {
    alert('введите пожалуйста число');
    +prompt('введите число')
  }

  return userNumber;
}



// // * 6. Запросить у пользователя ввод числа 2
//   const prompt2 = +prompt('введите число 2')
// // * 7. Отобразить сумму чисел в модальном окне
//   alert(`сумма ваших чисел ${prompt1 + prompt2}`)
const userName1 = promptWithValidation()
const userName2 = promptWithValidation()
// * 7. Отобразить сумму чисел в модальном окне
alert(`сумма ваших чисел ${userName1 + userName2}`)


/*
*
 function promptWithValidation() {
    prompt('введите число')
  }
* */
/*
*
* Сделайте функцию, которая будет вызывать prompt ->
* Если это значение NaN, тогда функция будет отображать alert
* и запрашивать у пользователя новое число!
*
* Если все таки число, тогда возвращает число
*
* */


/*
*
* функция которая будет принимать 3 аргумента числа
* и отображать в консоле сумму этих аргументов
*
*
* */

/*
*
* Функция будет принимать один аргумент объект
*
* у этого объекта будет ключ(cвойство) name
* {
*  name:'something'
* }
*
* и отображать -> привет "name"
*
* */

