/*

Отобразите 2 модальных окна, в которые пользователь вводит число.

Дальше выведите в модальном окне, сумму первых двух введенных чисел

*/

// const userNumber1 = prompt('Введите число 1')
// const userNumber2 = prompt('Введите число 2')
//
// alert(`ваше число: ${+userNumber1 + +userNumber2}`)

// if (10 > 100) {
//   /*ЕСЛИ*/
//   console.log('да тут у тебя 10')
// } else if (null != undefined) {
//   /*ИНАЧЕ ЕСЛИ*/
//   console.log('да ты тут')
// } else {
//   /*ИНАЧЕ*/
//   console.log('Шеф все пропало гипс снимают')
// }
/*
* отобразите модальное окно в которое можно ввести число
*
* если это число больше 150 -> отобразите в консоле -> 'Тайлайнд'
*
* если пользователь ввел число в промежутке между 0 - 100 -> 'Бали'
*
* */

// const userDrivePath = +prompt('лотерея билетов')
//
// if (userDrivePath > 150) {
//   console.log('Thailand')
// } else if (userDrivePath < 100) {
//   /*--->*/
//   if (userDrivePath >= 0) {
//     console.log('Бали')
//   }
// } else {
//   console.log('Italy')
// }

/*отобразите 3 числа*/



