
// Создайте объект
// Добавьте данному объекту свойства myCars, speed
// выведите в консоле предложение ->

// Все мои bmw, vaz ездят на скорости 360



const myNameIs = 'oLEG';
const correctName = // Oleg


// напишите конструкцию, которая будет превращать ваше имя написанное в таком же регистре как у меня
// имя с заглавной буквы и остальными буквы в маленьком регистре


var test = 'JaScript';
//console.log(test) // JavaScript

// google -> mdn

/*
 Для того, чтобы сделать переменную которая будет являться строкой, необходимо
 использовать одну из интерполяции строки
 Одинарные кавычки ' '
 Двойные кавычки " "
 Ё или консоль ` `
 */
